backend-api/app/Controllers/Api/Histori.php

    public function index() {
        return $this->respond((new HistoriModel())->orderBy('tanggal', 'DESC')->findAll());
---
SELECT *
FROM `histori`
ORDER BY `tanggal` DESC

    public function delete($id = null) {
        $hModel = new HistoriModel();
        $oldHistori = $hModel->find($id);

        if ($oldHistori) {
            // Jika histori dihapus, kembalikan stoknya seperti semula
            $this->updateStokBarang($oldHistori['id_barang'], $oldHistori['jenis_transaksi'], $oldHistori['jumlah'], 'revert');
            $hModel->delete($id);
---
SELECT *
FROM `histori`
WHERE `histori`.`id` = '1'
DELETE FROM `histori`
WHERE `id` IN ('1')

    private function updateStokBarang($id_barang, $jenis, $jumlah, $action) {
        $bModel = new BarangModel();
        $barang = $bModel->find($id_barang);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'