backend-api/app/Controllers/Api/Kategori.php

    public function index() {
        $model = new KategoriModel();
        return $this->respond($model->findAll());
---
SELECT *
FROM `kategori`