backend-api/app/Controllers/Api/Supplier.php

SELECT *
FROM `supplier`
---
    public function index() {
        return $this->respond((new SupplierModel())->findAll());