backend-api/app/Models/BarangModel.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`id_kategori`
ORDER BY `barang`.`id` DESC
---
    public function getBarangLengkap()
    {
        return $this->select('barang.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id = barang.id_kategori', 'left')
                    ->orderBy('barang.id', 'DESC')
                    ->findAll();